; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_3 ?v8 - type_3 ?v3 - type_1)
 	      (pred_2 ?v1 - object ?v3 - type_1)
	      (pred_4 ?v8 - type_3 ?v4 - type_2)
	      (pred_1 ?v8 - type_3 ?v1 - object ?v4 - type_2))

   (:action op_3
       :parameters  (?v8 - type_3 ?v5 ?v2 - type_1)
       :precondition (and  (pred_3 ?v8 ?v5))
       :effect (and  (pred_3 ?v8 ?v2)
		     (not (pred_3 ?v8 ?v5))))

   (:action op_1
       :parameters (?v8 - type_3 ?v7 - object ?v6 - type_1 ?v4 - type_2)
       :precondition  (and  (pred_2 ?v7 ?v6) (pred_3 ?v8 ?v6) (pred_4 ?v8 ?v4))
       :effect (and (pred_1 ?v8 ?v7 ?v4)
		    (not (pred_2 ?v7 ?v6)) 
		    (not (pred_4 ?v8 ?v4))))

   (:action op_2
       :parameters (?v8 - type_3 ?v7 - object ?v6 - type_1 ?v4 - type_2)
       :precondition  (and  (pred_1 ?v8 ?v7 ?v4) (pred_3 ?v8 ?v6))
       :effect (and (pred_2 ?v7 ?v6)
		    (pred_4 ?v8 ?v4)
		    (not (pred_1 ?v8 ?v7 ?v4)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_08 obj_02 - type_3
obj_03 obj_11 obj_01 obj_12 - type_2
obj_05 obj_07 obj_04 obj_10 - type_1
obj_09 obj_06 obj_13 - object)
(:init
(pred_3 obj_08 obj_07)
(pred_4 obj_08 obj_03)
(pred_4 obj_08 obj_11)
(pred_3 obj_02 obj_07)
(pred_4 obj_02 obj_01)
(pred_4 obj_02 obj_12)
(pred_2 obj_09 obj_05)
(pred_2 obj_06 obj_04)
(pred_2 obj_13 obj_07)
)
(:goal
(and
(pred_2 obj_09 obj_10)
(pred_2 obj_06 obj_07)
(pred_2 obj_13 obj_04)
)
)

(:constraints
  (always (not (pred_3 obj_08 obj_04)))
)
)

; plan
1. (op_1 obj_08 obj_13 obj_07 obj_11)
   deleted: (pred_2 obj_13 obj_07) (pred_4 obj_08 obj_11)
   added: (pred_1 obj_08 obj_13 obj_11)
   goals met: 0 of 3
2. (op_3 obj_02 obj_07 obj_05)
   deleted: (pred_3 obj_02 obj_07)
   added: (pred_3 obj_02 obj_05)
   goals met: 0 of 3
3. (op_1 obj_02 obj_09 obj_05 obj_12)
   deleted: (pred_2 obj_09 obj_05) (pred_4 obj_02 obj_12)
   added: (pred_1 obj_02 obj_09 obj_12)
   goals met: 0 of 3
4. (op_3 obj_02 obj_05 obj_10)
   deleted: (pred_3 obj_02 obj_05)
   added: (pred_3 obj_02 obj_10)
   goals met: 0 of 3
5. (op_2 obj_02 obj_09 obj_10 obj_12)
   deleted: (pred_1 obj_02 obj_09 obj_12)
   added: (pred_2 obj_09 obj_10) (pred_4 obj_02 obj_12)
   goals met: 1 of 3
6. (op_3 obj_02 obj_10 obj_04)
   deleted: (pred_3 obj_02 obj_10)
   added: (pred_3 obj_02 obj_04)
   goals met: 1 of 3
7. (op_1 obj_02 obj_06 obj_04 obj_12)
   deleted: (pred_2 obj_06 obj_04) (pred_4 obj_02 obj_12)
   added: (pred_1 obj_02 obj_06 obj_12)
   goals met: 1 of 3
8. (op_3 obj_02 obj_04 obj_07)
   deleted: (pred_3 obj_02 obj_04)
   added: (pred_3 obj_02 obj_07)
   goals met: 1 of 3
9. (op_2 obj_02 obj_06 obj_07 obj_12)
   deleted: (pred_1 obj_02 obj_06 obj_12)
   added: (pred_2 obj_06 obj_07) (pred_4 obj_02 obj_12)
   goals met: 2 of 3
10. (op_2 obj_08 obj_13 obj_07 obj_11)
   deleted: (pred_1 obj_08 obj_13 obj_11)
   added: (pred_2 obj_13 obj_07) (pred_4 obj_08 obj_11)
   goals met: 2 of 3
11. (op_1 obj_02 obj_13 obj_07 obj_12)
   deleted: (pred_2 obj_13 obj_07) (pred_4 obj_02 obj_12)
   added: (pred_1 obj_02 obj_13 obj_12)
   goals met: 2 of 3
12. (op_3 obj_02 obj_07 obj_04)
   deleted: (pred_3 obj_02 obj_07)
   added: (pred_3 obj_02 obj_04)
   goals met: 2 of 3
13. (op_2 obj_02 obj_13 obj_04 obj_12)
   deleted: (pred_1 obj_02 obj_13 obj_12)
   added: (pred_2 obj_13 obj_04) (pred_4 obj_02 obj_12)
   goals met: 3 of 3
